constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (particles air);

particles
{
    diameterModel constant;
    constantCoeffs
    {
        d           42.1e-6;     // APR changed from 3e-4 to 100e-6
    }

    alphaMax        0.535;       // APR changed from 0.62 to 0.65
    residualAlpha   1e-6;
}

air
{
    diameterModel constant;
    constantCoeffs
    {
        d           1;
    }
    
    frictionModel None;
    NoneCoeffs
    {
    }
    residualAlpha   0;
}

blending
{
    default
    {
        type            none;
        continuousPhase air;
    }
}

sigma
(
    (particles and air) 0
);

aspectRatio
(
);

drag
(
    (particles in air)
    {
        type            GidaspowErgunWenYu;      // APR changed from GidaspowErgunWenYu
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }
);

// APR Completely deleted virtual mass
virtualMass
(
);

heatTransfer
(
    (particles in air)
    {
        type            RanzMarshall;
        residualAlpha   1e-3;
    }
);

lift
(
);

wallLubrication
(
);

turbulentDispersion
(
);

// Minimum allowable pressure
pMin            10000;


// ************************************************************************* //
