system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     twoPhaseEulerFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         14.85;      // APR changed from 2 to 6

deltaT          1e-5;   // APR changed from 2e-4 to 1e-4

writeControl    runTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable on;

adjustTimeStep  yes;

maxCo           0.025;

maxDeltaT       1e-3;

functions
{

    #includeFunc  singleGraph

    #includeFunc  residuals
    
    fieldAverage1
    {
        type            fieldAverage;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
        timeStart             0.0;
        timeEnd               15.0;
        
        fields
        (
            alpha.particles
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

            p
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
       
        );
    }
       
  MassflowOrificeTop
  {
        type            surfaceFieldValue;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        writeControl adjustableRunTime;
        writeInterval 0.05;
        writeFields true;
        regionType faceZone;   
        name massFlowSurfaceTop; 
        // Operation: areaAverage/sum/weightedAverage ...
        operation       sum;
        surfaceFormat   raw;

        fields
        (
            phi.particles
            phi.air
        );
  }

  MassflowOrificeBottom
  {
        type            surfaceFieldValue;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        writeControl adjustableRunTime;
        writeInterval 0.05;
        writeFields true;
        regionType faceZone;
        name massFlowSurfaceBottom;
        // Operation: areaAverage/sum/weightedAverage ...
        operation       sum;
        surfaceFormat   raw;

        fields
        (
            phi.particles
            phi.air
        );
  }




    residuals
    {
        type            residuals;
        functionObjectLibs ("libutilityFunctionObjects.so");
        enabled         true;
        outputControl   timeStep;
        outputInterval  1;

        fields
        (
            p_rgh
            alpha.particles
            Theta.particles
        );
    }

}


// ************************************************************************* //
