system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;

libs ("libsampling.so");

interpolationScheme cellPoint; 
  
setFormat       raw; 
  
sets 
( 
    line 
    { 
        type    uniform; 
        axis    y; 
        start   (0 0 0); 
        end     (0 0.078 0); 
        nPoints 1000; 
    } 
); 
 
fields          (pMean alpha.particlesMean p alpha.particles); 

// ************************************************************************* //
